[
    {
      "id": 1,
      "title": "The Midnight Library",
      "author": "Matt Haig",
      "cover": "https://i.pinimg.com/474x/ea/87/e5/ea87e5dd6bd36ccea9299fc024f08c09.jpg",
      "rating": 4.02,
      "genres": ["Fiction", "Fantasy", "Self-Help"],
      "description": "Between life and death there is a library where the shelves go on forever. Every book provides a chance to try another life you could have lived. Nora Seed finds herself here after attempting suicide, guided by her childhood librarian Mrs. Elm. As she tries different versions of her life - as a glaciologist, Olympic swimmer, rock star, and more - she must confront her regrets and discover what truly makes life worth living. This poignant novel blends magical realism with profound philosophical questions about choice and happiness.",
      "pages": 304,
      "published": "August 13, 2020",
      "founder": "Matt Haig",
      "ratingReview": "A thought-provoking and heartwarming story about choices and regrets.",
      "reviews": [
        {
          "title": "Life-Changing Perspective",
          "description": "This book made me reflect deeply on my own choices. Haig's writing is accessible yet profound.",
          "username": "BookLover42"
        },
        {
          "title": "Beautiful but Flawed",
          "description": "Loved the premise but some alternate lives felt rushed. Still stays with you long after reading.",
          "username": "LiteraryExplorer"
        }
      ]
    },
    {
      "id": 2,
      "title": "Dune",
      "author": "Frank Herbert",
      "cover": "https://i.pinimg.com/474x/14/a7/48/14a74879788212584f4b59c22c5e6d99.jpg",
      "rating": 4.25,
      "genres": ["Science Fiction", "Classic", "Adventure"],
      "description": "Set in the distant future amidst a feudal interstellar society, Dune tells the story of young Paul Atreides, whose family accepts control of the desert planet Arrakis. As this planet is the only source of the 'spice' melange, the most valuable substance in the universe, control of Arrakis is highly contested. When Paul and his family are betrayed, he must lead the Fremen, Arrakis's native inhabitants, in a battle for control of the planet and its spice. This epic explores themes of politics, religion, ecology, and human emotion.",
      "pages": 412,
      "published": "August 1, 1965",
      "founder": "Frank Herbert",
      "ratingReview": "A masterpiece of science fiction with complex characters and world-building.",
      "reviews": [
        {
          "title": "The Sci-Fi Bible",
          "description": "Herbert created an entire universe with its own ecology, politics and religion. Mind-blowing in scope.",
          "username": "SciFiNerd"
        },
        {
          "title": "Dense but Rewarding",
          "description": "The first 100 pages are challenging with all the terminology, but once it clicks, it's unforgettable.",
          "username": "PatientReader"
        }
      ]
    },
    {
      "id": 3,
      "title": "Where the Crawdads Sing",
      "author": "Delia Owens",
      "cover": "https://i.pinimg.com/474x/70/27/ca/7027ca56ac260a52ff0a88700123d6f9.jpg",
      "rating": 4.46,
      "genres": ["Fiction", "Mystery", "Literary Fiction"],
      "description": "For years, rumors of the 'Marsh Girl' have haunted Barkley Cove, a quiet town on the North Carolina coast. In 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Abandoned by her family, she has survived alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. When two young men become intrigued by her wild beauty, Kya opens herself to a new life - until the unthinkable happens. This atmospheric novel is both a coming-of-age story and a murder mystery.",
      "pages": 384,
      "published": "August 14, 2018",
      "founder": "Delia Owens",
      "ratingReview": "Beautifully written with a compelling mystery and rich natural descriptions.",
      "reviews": [
        {
          "title": "Nature as a Character",
          "description": "The marsh is so vividly described it becomes a main character. Owens' background as a wildlife scientist shines.",
          "username": "NatureWriter"
        },
        {
          "title": "Overhyped but Good",
          "description": "The prose is beautiful but the plot has some predictable elements. Still worth reading for the atmosphere.",
          "username": "CriticalReader"
        }
      ]
    },
    {
      "id": 4,
      "title": "Atomic Habits",
      "author": "James Clear",
      "cover": "https://images-na.ssl-images-amazon.com/images/I/91bYsX41DVL.jpg",
      "rating": 4.37,
      "genres": ["Nonfiction", "Self-Help", "Psychology"],
      "description": "No matter your goals, Atomic Habits offers a proven framework for improving - every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results. Drawing on insights from biology, psychology, and neuroscience, Clear creates an easy-to-understand guide for making good habits inevitable and bad habits impossible. The book will reshape how you think about progress and success.",
      "pages": 320,
      "published": "October 16, 2018",
      "founder": "James Clear",
      "ratingReview": "Practical advice backed by scientific research on habit formation.",
      "reviews": [
        {
          "title": "Actually Changed My Life",
          "description": "Implemented the 1% better every day concept and it's transformed my productivity. Simple but powerful.",
          "username": "HabitChanger"
        },
        {
          "title": "Repackaged Wisdom",
          "description": "Good advice but not revolutionary if you've read other habit books. Well-organized though.",
          "username": "SelfHelpVeteran"
        }
      ]
    },
    {
      "id": 5,
      "title": "The Silent Patient",
      "author": "Alex Michaelides",
      "cover": "https://images-na.ssl-images-amazon.com/images/I/81LByMrR3VL.jpg",
      "rating": 4.18,
      "genres": ["Thriller", "Mystery", "Psychological Fiction"],
      "description": "Alicia Berenson's life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house overlooking a park in one of London's most desirable areas. One evening, her husband Gabriel returns home late, and Alicia shoots him five times in the face and then never speaks another word. Theo Faber is a criminal psychotherapist who waits years for the chance to work with Alicia. His determination to get her to talk and unravel the mystery of why she shot her husband takes him down a twisting path into his own motivations.",
      "pages": 325,
      "published": "February 5, 2019",
      "founder": "Alex Michaelides",
      "ratingReview": "A gripping and twisty thriller that keeps you guessing until the end.",
      "reviews": [
        {
          "title": "Did NOT See That Coming",
          "description": "The twist completely blindsided me. One of the best psychological thrillers I've read in years.",
          "username": "ThrillerFanatic"
        },
        {
          "title": "Overrated Twist",
          "description": "The buildup was great but the ending felt gimmicky to me. Still an entertaining read.",
          "username": "MysteryLover"
        }
      ]
    },
    {
      "id": 6,
      "title": "Project Hail Mary",
      "author": "Andy Weir",
      "cover": "https://images-na.ssl-images-amazon.com/images/I/91XKEeOQolL.jpg",
      "rating": 4.52,
      "genres": ["Science Fiction", "Adventure", "Space Opera"],
      "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission - and if he fails, humanity and Earth itself will perish. Except he doesn't know that. He can't even remember his own name, let alone the nature of his assignment or how to complete it. As he gradually pieces together his memory, he realizes an impossible task now confronts him. Hurtling through space with only two corpses for company, he must conquer an extinction-level threat to our species. With shades of The Martian, this novel blends scientific problem-solving with first contact narrative.",
      "pages": 496,
      "published": "May 4, 2021",
      "founder": "Andy Weir",
      "ratingReview": "An exciting and scientifically grounded space adventure.",
      "reviews": [
        {
          "title": "Better Than The Martian",
          "description": "Rocky is the best alien character ever created. The science is fascinating but the heart of the story is unforgettable.",
          "username": "SpaceGeek"
        },
        {
          "title": "Science Over Story",
          "description": "The technical details are impressive but the emotional beats didn't always land for me.",
          "username": "CharacterReader"
        }
      ]
    },
    {
      "id": 7,
      "title": "The Seven Husbands of Evelyn Hugo",
      "author": "Taylor Jenkins Reid",
      "cover": "https://images-na.ssl-images-amazon.com/images/I/91a-dLmEExL.jpg",
      "rating": 4.45,
      "genres": ["Historical Fiction", "LGBTQ+", "Romance"],
      "description": "Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. When she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. As Evelyn unfurls her story - revealing her ruthless ambition, unexpected friendship, and forbidden great love - Monique begins to feel a very real connection to the actress. But as Evelyn's story nears its conclusion, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways.",
      "pages": 389,
      "published": "June 13, 2017",
      "founder": "Taylor Jenkins Reid",
      "ratingReview": "A captivating and emotional story about love, fame, and identity.",
      "reviews": [
        {
          "title": "Evelyn Hugo Stays With You",
          "description": "This fictional star feels more real than actual celebrities. Her complexity and flaws make her unforgettable.",
          "username": "OldHollywoodFan"
        },
        {
          "title": "Overly Dramatic",
          "description": "Enjoyable but sometimes the twists felt contrived. Great examination of Hollywood's golden age though.",
          "username": "RealisticReader"
        }
      ]
    }
  ]
  